/******************************************************************************/
/**\file uart_pro.h
 * @Author       : Shunyi
 * @Date         : 2020-06-11 08:33:55
 * @LastEditors  : Shunyi
 * @LastEditTime : 2020-06-30 15:26:42
 ******************************************************************************/
 
#ifndef  __UART_PRO_H_
#define  __UART_PRO_H_

/******************************************************************************
 * Include files
 ******************************************************************************/
#include "gpio.h"
#include "uart.h"

#include "user.h"

/******************************************************************************
 * Local pre-processor symbols/macros ('#define')                            
 ******************************************************************************/
#define     T1_PORT                 (3)
#define     T1_PIN                  (3)

/*****************************************************************************
 * Function implementation
 ******************************************************************************/
void App_Uart1PortInit(void); //UART1引脚配置
void App_Uart1Cfg(uint32_t Baud); //UART1参数配置 //传入波特率
void App_Uart1Init(uint32_t Baud); //UART1初始化 //传入波特率
void App_UartSend(M0P_UART_TypeDef* UARTx, const uint8_t * DataSendBuffer, const uint8_t DataSendBufferLen); //UART发送数据

#endif
/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
